---
kind: property
id: P:Autodesk.Revit.DB.Visual.Tile.TextureOffsetLock
source: html/914b4666-6c95-5ca7-ca05-f7a834e516ca.htm
---
# Autodesk.Revit.DB.Visual.Tile.TextureOffsetLock Property

The property labeled "Offset Lock" from the "Tile" schema.

## Syntax (C#)
```csharp
public static string TextureOffsetLock { get; }
```

## Remarks
This property is of type "AssetPropertyBoolean".